#include"Gate_Cfg.h"

/*---------------------------------------------------------------------------*/
/* 内部変数                                                                  */
/*---------------------------------------------------------------------------*/
static unsigned int isExecutable;

/*---------------------------------------------------------------------------*/
/* モジュール内定数                                                          */
/*---------------------------------------------------------------------------*/
volatile const GateConfig gateConfig = { true, false };

/*---------------------------------------------------------------------------*/
/* 公開関数                                                                  */
/*---------------------------------------------------------------------------*/
/* 適当実装 */
void GateImplSet(bool newIsExecutable)
{
	isExecutable = newIsExecutable;
}

bool GateImplValidate(void)
{
	return false;
}
bool GateImplGet(void)
{
	return isExecutable;
}
